package henkan;

public class henkan{

  public String tanni[]       = {"oz(オンス)", "lb(ポンド)", "g(グラム)", "kg(キログラム)", "インチ", "フィート", "ヤード", "マイル", "mm(ミリメートル)", "cm(センチメートル)", "m(メートル)", "km(キロメートル)", "km/h(時速)", "m/s(秒速)", "M/h(マイル/h)", "km/h(時速)", "kn(ノット)"};
  public float kansan[]       = {28.35F, 0.4536F, 0.03527F, 2.205F, 25.4F, 30.48F, 0.9144F, 1.6093F, 0.03937F, 0.3937F, 1.094F, 0.6214F, 0.27777F, 3.6F, 1.609F, 0.6215F, 1.852F};
  public String henkanTanni[] = {"g(グラム)", "kg(キログラム)", "oz(オンス)", "lb(ポンド)", "mm(ミリメートル)", "cm(センチメートル)", "m(メートル)", "km(キロメートル)", "インチ", "インチ", "ヤード", "マイル", "m/s(秒速)", "km/h(時速)", "km/h(時速)", "M/h(マイル/h)", "km/h(時速)"};

}
